<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">

<html>
<head>
	<title>Untitled</title>
	<LINK REL=StyleSheet HREF="../nat.css" TYPE="text/css">
</head>

<body>

<H2>Scelta delle tecnologie e componenti</h2>

<h4>Piattaforma?</h4>
<p>Il progetto parte senza nessun supporto finanziario, vincolo per tutte le tecnologie 
  utilizzate &egrave; quindi il <strong>costo zero</strong>.</p>
<p> Si &egrave; valutata come piattaforma ideale per lo sviluppo della logica 
  applicativa <strong>PHP4</strong>, rispetto a Java/jsp:<br>
  - maggiore esperienza dell'attuale team di sviluppo<br>
  - maggiore numero si componenti riutilizzabili disponibili in rete<br>
  - performance migliori (risparmio sulle risorse hardware)<br>
  Nonstante i seguenti fattori a sfavore:<br>
  - non &egrave; attualmente nei piani didattici della facolt&agrave; in cui parte 
  il progetto<br>
  - peggiore supporto all'OOP</p>
<h4>La rete d'ateneo</h4>
<p>Il sistema pur rimanendo portabile su tutte le piattaforme su cui PHP &egrave; 
  funzionante, &egrave; legato a molti sistemi presenti nella <strong>rete di 
  Ateneo</strong> con una fitta rete di interazioni. </p>
<p>Si vuole interagire con tutte le strutture pre-esistenti integrandole e senza 
  creare replicazioni inutili (si veda <a href="../M02_obiettivi/obiettivi.html">obbiettivi</a>).</p>
<p>Nella seguente immagine &egrave; riportato lo schema nel caso particolare della 
  prima implementazione che riguarda la facolt&agrave; di ingegneria, ed in gran 
  parte valida per tutto l'ateneo.</p>
<p><img src="infrastruttura.png" width="533" height="400"></p>


<h4>Gestire la complessit&agrave; delle interazioni</h4>
<p>Dallo schema sopra si pu&ograve; facilmente intuire l'elevata complessit&agrave; 
  delle interazioni che influiscono con il sistema, si mettono in risalto le problematiche 
  principali che sono state affrontate:</p>
<ul>
  <li>Ridurre al minimo la non fruibilit&agrave; dei servizi in caso di down-time 
    di una delle fonti dati esterne</li>
  <li>Mantenere confinata la dipendenza dell'applicazione dalle fonti esterne</li>
  <li>Utilizzare componenti di astrazione, per ridurre la complessit&agrave; dei 
    &quot;collegamenti&quot;</li>
</ul>
<p>Per la persistenza dei dati locale ci si appoggia su <strong>database relazionale 
  SQL</strong>, con l'idea introdurre uno strato di astrazione dallo specifico 
  database utilizzato tramite la ormai collaudata classe <strong>ADODB</strong>, 
  la creazione dello schema sar&agrave; principalmente sviluppata per <strong>PostgreSQL</strong> 
  e in seguito per <strong>MySQL</strong> ed altri database.<br>
  I Log dell'applicazione sono registrati direttamente sul filesystem del webserver.</p>
<p>Per l'accesso ai web services &egrave; stato testato con successo il package 
  <strong>NuSOAP</strong></p>
<p>Per lo strato di presentazione, si sono considerati vari template engine per 
  PHP per generare l'output dell'applicazione , e di &egrave; scelto di utilizzare 
  <strong>Smarty</strong> per la sua ampia diffusione e affidabilit&agrave;.<br>
  L'output dovr&agrave; essere <strong>XHTML compatibile</strong> ed in linea 
  con le norme di accessibilit&agrave; del W3C-WAI, obbiettivo &egrave; creare 
  un sito compatibile almeno con lo standard AA.</p>
<p>Per l'invio di e-mail viene utilizzato <strong>PHPMailer</strong>, che permette 
  il collegamento diretto ad un server SMTP senza altri componenti intermediari 
  dipendenti dal sistema operativo.</p>
<p>Una grossa problematica gi&agrave; riscontrata al momento della precedente 
  versione del progetto riguarda l'accesso al sistema di autenticazione <strong>MS 
  Active Directory </strong>considerato necessario dalle strutture dell'ateneo.<br>
  Il sistema AD &egrave; di tipo proprietario e dispone di un'interfaccia esterna 
  che si &egrave; verificata non compatibile con lo standard <strong>LDAP</strong>. 
  La soluzione del problema richiede lo sviluppo di un componente ad hoc per scavalcare 
  il problema.</p>
<p><img src="componenti.png" width="533" height="400"></p>
<h4>Informazioni sui componenti utilizzati</h4>
<p>PHPMailer - <a href="http://phpmailer.sourceforge.net/" target="_blank">http://phpmailer.sourceforge.net/</a></p>
<p>ADOdb - <a href="http://php.weblogs.com/ADODB" target="_blank">http://php.weblogs.com/ADODB</a></p>
<p>NuSOAP - <a href="http://dietrich.ganx4.com/nusoap/index.php" target="_blank">http://dietrich.ganx4.com/nusoap/index.php</a></p>
<p>Smarty - <a href="http://smarty.php.net/" target="_blank">http://smarty.php.net/</a></p>
</body>
</html>
